MikroElektronika/core_packages/PIC/XC8/def/PIC16F18313/mcu.h
// Register: NCO1CLK
#define NCO1CLK NCO1CLK
extern volatile unsigned char           NCO1CLK             __at(0x49F);
#ifndef _LIB_BUILD
asm("NCO1CLK equ 049Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned N1CKS                  :2;
        unsigned                        :3;
        unsigned N1PWS                  :3;
    };
} NCO1CLKbits_t;
extern volatile NCO1CLKbits_t NCO1CLKbits __at(0x49F);
// bitfield macros
#define _NCO1CLK_N1CKS_POSN                                 0x0
#define _NCO1CLK_N1CKS_POSITION                             0x0
#define _NCO1CLK_N1CKS_SIZE                                 0x2
#define _NCO1CLK_N1CKS_LENGTH                               0x2
#define _NCO1CLK_N1CKS_MASK                                 0x3
#define _NCO1CLK_N1PWS_POSN                                 0x5
#define _NCO1CLK_N1PWS_POSITION                             0x5
#define _NCO1CLK_N1PWS_SIZE                                 0x3
#define _NCO1CLK_N1PWS_LENGTH                               0x3
#define _NCO1CLK_N1PWS_MASK                                 0xE0

// Register: PWM5DCL
#define PWM5DCL PWM5DCL
extern volatile unsigned char           PWM5DCL             __at(0x617);
#ifndef _LIB_BUILD
asm("PWM5DCL equ 0617h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned PWM5DCL                :2;
    };
    struct {
        unsigned                        :6;
        unsigned PWM5DCL0               :1;
        unsigned PWM5DCL1               :1;
    };
} PWM5DCLbits_t;
extern volatile PWM5DCLbits_t PWM5DCLbits __at(0x617);
// bitfield macros
#define _PWM5DCL_PWM5DCL_POSN                               0x6
#define _PWM5DCL_PWM5DCL_POSITION                           0x6
#define _PWM5DCL_PWM5DCL_SIZE                               0x2
#define _PWM5DCL_PWM5DCL_LENGTH                             0x2
#define _PWM5DCL_PWM5DCL_MASK                               0xC0
#define _PWM5DCL_PWM5DCL0_POSN                              0x6
#define _PWM5DCL_PWM5DCL0_POSITION                          0x6
#define _PWM5DCL_PWM5DCL0_SIZE                              0x1
#define _PWM5DCL_PWM5DCL0_LENGTH                            0x1
#define _PWM5DCL_PWM5DCL0_MASK                              0x40
#define _PWM5DCL_PWM5DCL1_POSN                              0x7
#define _PWM5DCL_PWM5DCL1_POSITION                          0x7
#define _PWM5DCL_PWM5DCL1_SIZE                              0x1
#define _PWM5DCL_PWM5DCL1_LENGTH                            0x1
#define _PWM5DCL_PWM5DCL1_MASK                              0x80

// Register: PWM5DCH
#define PWM5DCH PWM5DCH
extern volatile unsigned char           PWM5DCH             __at(0x618);
#ifndef _LIB_BUILD
asm("PWM5DCH equ 0618h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM5DCH                :8;
    };
    struct {
        unsigned PWM5DCH0               :1;
        unsigned PWM5DCH1               :1;
        unsigned PWM5DCH2               :1;
        unsigned PWM5DCH3               :1;
        unsigned PWM5DCH4               :1;
        unsigned PWM5DCH5               :1;
        unsigned PWM5DCH6               :1;
        unsigned PWM5DCH7               :1;
    };
} PWM5DCHbits_t;
extern volatile PWM5DCHbits_t PWM5DCHbits __at(0x618);
// bitfield macros
#define _PWM5DCH_PWM5DCH_POSN                               0x0
#define _PWM5DCH_PWM5DCH_POSITION                           0x0
#define _PWM5DCH_PWM5DCH_SIZE                               0x8
#define _PWM5DCH_PWM5DCH_LENGTH                             0x8
#define _PWM5DCH_PWM5DCH_MASK                               0xFF
#define _PWM5DCH_PWM5DCH0_POSN                              0x0
#define _PWM5DCH_PWM5DCH0_POSITION                          0x0
#define _PWM5DCH_PWM5DCH0_SIZE                              0x1
#define _PWM5DCH_PWM5DCH0_LENGTH                            0x1
#define _PWM5DCH_PWM5DCH0_MASK                              0x1
#define _PWM5DCH_PWM5DCH1_POSN                              0x1
#define _PWM5DCH_PWM5DCH1_POSITION                          0x1
#define _PWM5DCH_PWM5DCH1_SIZE                              0x1
#define _PWM5DCH_PWM5DCH1_LENGTH                            0x1
#define _PWM5DCH_PWM5DCH1_MASK                              0x2
#define _PWM5DCH_PWM5DCH2_POSN                              0x2
#define _PWM5DCH_PWM5DCH2_POSITION                          0x2
#define _PWM5DCH_PWM5DCH2_SIZE                              0x1
#define _PWM5DCH_PWM5DCH2_LENGTH                            0x1
#define _PWM5DCH_PWM5DCH2_MASK                              0x4
#define _PWM5DCH_PWM5DCH3_POSN                              0x3
#define _PWM5DCH_PWM5DCH3_POSITION                          0x3
#define _PWM5DCH_PWM5DCH3_SIZE                              0x1
#define _PWM5DCH_PWM5DCH3_LENGTH                            0x1
#define _PWM5DCH_PWM5DCH3_MASK                              0x8
#define _PWM5DCH_PWM5DCH4_POSN                              0x4
#define _PWM5DCH_PWM5DCH4_POSITION                          0x4
#define _PWM5DCH_PWM5DCH4_SIZE                              0x1
#define _PWM5DCH_PWM5DCH4_LENGTH                            0x1
#define _PWM5DCH_PWM5DCH4_MASK                              0x10
#define _PWM5DCH_PWM5DCH5_POSN                              0x5
#define _PWM5DCH_PWM5DCH5_POSITION                          0x5
#define _PWM5DCH_PWM5DCH5_SIZE                              0x1
#define _PWM5DCH_PWM5DCH5_LENGTH                            0x1
#define _PWM5DCH_PWM5DCH5_MASK                              0x20
#define _PWM5DCH_PWM5DCH6_POSN                              0x6
#define _PWM5DCH_PWM5DCH6_POSITION                          0x6
#define _PWM5DCH_PWM5DCH6_SIZE                              0x1
#define _PWM5DCH_PWM5DCH6_LENGTH                            0x1
#define _PWM5DCH_PWM5DCH6_MASK                              0x40
#define _PWM5DCH_PWM5DCH7_POSN                              0x7
#define _PWM5DCH_PWM5DCH7_POSITION                          0x7
#define _PWM5DCH_PWM5DCH7_SIZE                              0x1
#define _PWM5DCH_PWM5DCH7_LENGTH                            0x1
#define _PWM5DCH_PWM5DCH7_MASK                              0x80

// Register: PWM5CON
#define PWM5CON PWM5CON
extern volatile unsigned char           PWM5CON             __at(0x619);
#ifndef _LIB_BUILD
asm("PWM5CON equ 0619h");
#endif
// aliases
extern volatile unsigned char           PWM5CON0            __at(0x619);
#ifndef _LIB_BUILD
asm("PWM5CON0 equ 0619h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned PWM5POL                :1;
        unsigned PWM5OUT                :1;
        unsigned                        :1;
        unsigned PWM5EN                 :1;
    };
} PWM5CONbits_t;
extern volatile PWM5CONbits_t PWM5CONbits __at(0x619);
// bitfield macros
#define _PWM5CON_PWM5POL_POSN                               0x4
#define _PWM5CON_PWM5POL_POSITION                           0x4
#define _PWM5CON_PWM5POL_SIZE                               0x1
#define _PWM5CON_PWM5POL_LENGTH                             0x1
#define _PWM5CON_PWM5POL_MASK                               0x10
#define _PWM5CON_PWM5OUT_POSN                               0x5
#define _PWM5CON_PWM5OUT_POSITION                           0x5
#define _PWM5CON_PWM5OUT_SIZE                               0x1
#define _PWM5CON_PWM5OUT_LENGTH                             0x1
#define _PWM5CON_PWM5OUT_MASK                               0x20
#define _PWM5CON_PWM5EN_POSN                                0x7
#define _PWM5CON_PWM5EN_POSITION                            0x7
#define _PWM5CON_PWM5EN_SIZE                                0x1
#define _PWM5CON_PWM5EN_LENGTH                              0x1
#define _PWM5CON_PWM5EN_MASK                                0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned PWM5POL                :1;
        unsigned PWM5OUT                :1;
        unsigned                        :1;
        unsigned PWM5EN                 :1;
    };
} PWM5CON0bits_t;
extern volatile PWM5CON0bits_t PWM5CON0bits __at(0x619);
// bitfield macros
#define _PWM5CON0_PWM5POL_POSN                              0x4
#define _PWM5CON0_PWM5POL_POSITION                          0x4
#define _PWM5CON0_PWM5POL_SIZE                              0x1
#define _PWM5CON0_PWM5POL_LENGTH                            0x1
#define _PWM5CON0_PWM5POL_MASK                              0x10
#define _PWM5CON0_PWM5OUT_POSN                              0x5
#define _PWM5CON0_PWM5OUT_POSITION                          0x5
#define _PWM5CON0_PWM5OUT_SIZE                              0x1
#define _PWM5CON0_PWM5OUT_LENGTH                            0x1
#define _PWM5CON0_PWM5OUT_MASK                              0x20
#define _PWM5CON0_PWM5EN_POSN                               0x7
#define _PWM5CON0_PWM5EN_POSITION                           0x7
#define _PWM5CON0_PWM5EN_SIZE                               0x1
#define _PWM5CON0_PWM5EN_LENGTH                             0x1
#define _PWM5CON0_PWM5EN_MASK                               0x80

// Register: PWM6DCL
#define PWM6DCL PWM6DCL
extern volatile unsigned char           PWM6DCL             __at(0x61A);
#ifndef _LIB_BUILD
asm("PWM6DCL equ 061Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned PWM6DCL                :2;
    };
    struct {
        unsigned                        :6;
        unsigned PWM6DCL0               :1;
        unsigned PWM6DCL1               :1;
    };
} PWM6DCLbits_t;
extern volatile PWM6DCLbits_t PWM6DCLbits __at(0x61A);
// bitfield macros
#define _PWM6DCL_PWM6DCL_POSN                               0x6
#define _PWM6DCL_PWM6DCL_POSITION                           0x6
#define _PWM6DCL_PWM6DCL_SIZE                               0x2
#define _PWM6DCL_PWM6DCL_LENGTH                             0x2
#define _PWM6DCL_PWM6DCL_MASK                               0xC0
#define _PWM6DCL_PWM6DCL0_POSN                              0x6
#define _PWM6DCL_PWM6DCL0_POSITION                          0x6
#define _PWM6DCL_PWM6DCL0_SIZE                              0x1
#define _PWM6DCL_PWM6DCL0_LENGTH                            0x1
#define _PWM6DCL_PWM6DCL0_MASK                              0x40
#define _PWM6DCL_PWM6DCL1_POSN                              0x7
#define _PWM6DCL_PWM6DCL1_POSITION                          0x7
#define _PWM6DCL_PWM6DCL1_SIZE                              0x1
#define _PWM6DCL_PWM6DCL1_LENGTH                            0x1
#define _PWM6DCL_PWM6DCL1_MASK                              0x80

// Register: PWM6DCH
#define PWM6DCH PWM6DCH
extern volatile unsigned char           PWM6DCH             __at(0x61B);
#ifndef _LIB_BUILD
asm("PWM6DCH equ 061Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM6DCH                :8;
    };
    struct {
        unsigned PWM6DCH0               :1;
        unsigned PWM6DCH1               :1;
        unsigned PWM6DCH2               :1;
        unsigned PWM6DCH3               :1;
        unsigned PWM6DCH4               :1;
        unsigned PWM6DCH5               :1;
        unsigned PWM6DCH6               :1;
        unsigned PWM6DCH7               :1;
    };
} PWM6DCHbits_t;
